# Используйте официальный образ Node.js версии 20
FROM node:20

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Аргумент для указания пути к папке, которую нужно скопировать в контейнер
ARG SOURCE_DIR

# Копируем все файлы из текущей директории в контейнер
COPY ${SOURCE_DIR} .

# Устанавливаем зависимости
RUN npm install

# Указываем порт, который будет слушать приложение внутри контейнера
EXPOSE 5001

# Команда для запуска приложения при старте контейнера
CMD ["npm", "start"]


